_posts/2016-05-30-basics-of-an-llc.html
---
layout: post
title: Basics of an LLC
excerpt: Some information on setting up an LLC
---

<p>
Taking John Sonmez's advice on treating your career like a personal business, I have been researching LLCs and some basic information on setting them up.
</p>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> What are LLCs?</h2>
<div class="outline-text-2" id="text-1">
<p>
LLCs, or <i>limited-liability corporations</i>, are basically legal entities that allow you to separate your business assets from your personal assets.
</p>

<ul class="org-ul">
<li>With a sole proprietorship or partnership, you are personally responsible for any damages from lawsuits, etc.
</li>
<li>With an LLC, the most that can happen is that you'll lose your business assets&#x2013;not your car, home, etc.
</li>
</ul>

<p>
As with all businesses, LLCs have to be registered within a state. An LLC registered in a state is a <i>domestic</i> LLC in that state and a <i>foreign</i> LLC to other states. Foreign LLCs have to jump through more hoops&#x2013;file more documents, pay higher yearly fees to remain registered, etc.
</p>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> How do I set one up?</h2>
<div class="outline-text-2" id="text-2">
<p>
Simply go to the state's website&#x2013;Wisconsin's is <a href="https://www.wdfi.org/corporations/forms/corp183forms.htm">here</a>&#x2013;and fill out some documents. The filing fee for Wisconsin as of May 30, 2016 is $130 online and $170 in paper.
</p>

<p>
If you don't want to do all the paperwork yourself, legal services for this sort of thing is <i>very</i> affordable. I got a lot of good information from a single phone call with <a href="https://www.legalzoom.com/">LegalZoom</a>. If I register for an LLC, I'll probably choose this route. The reason is simple&#x2013;there's no point climbing a learning curve (in this case, filing legal paperwork for a business) <i>once</i>; your time is better spent on other things.
</p>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> What about taxes?</h2>
<div class="outline-text-2" id="text-3">
<p>
Taxation is a whole different topic from registration, and I won't try to cover it here. Talking to a tax professional would be a good idea.
</p>
</div>
</div>
